vlm/extension/Documents/ПриобретениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриобретениеТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_ПроцентБрака</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Documents/ПриобретениеТоваровУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [02.06.2025 13:24:52] +
	
	НовыйЭлемент = Элементы.Вставить("бит_ТоварыКоличество", Тип("ПолеФормы"), Элементы.Товары, Элементы.ТоварыКоличествоУпаковок);
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_Количество"; 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_ТоварыКоличествоПриИзменении");   
	
	НовыйЭлемент = Элементы.Вставить("бит_ТоварыПроцентБрака", Тип("ПолеФормы"), Элементы.Товары, Элементы.ТоварыКоличествоУпаковок);
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_ПроцентБрака"; 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_ТоварыПроцентБракаПриИзменении");  
	
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.бит_ТоварыКоличество.Имя);
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.бит_ТоварыПроцентБрака.Имя);
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Номенклатура.ТипНоменклатуры");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно; 
	//ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыНоменклатуры.МногооборотнаяТара;
	//Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);    
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.бит_ТоварыКоличество.Имя);  
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.бит_ТоварыПроцентБрака.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно; 
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыНоменклатуры.МногооборотнаяТара;
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);  
	
 
	// }}ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [02.06.2025 13:24:55] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ТоварыКоличествоПриИзменении(Элемент)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [02.06.2025 13:24:52] +        
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ЭтоТара = бит_ЭтоТара(ТекущиеДанные.Номенклатура);
	Если ЭтоТара Тогда
		бит_ПересчитатьКоличество(ТекущиеДанные); 
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [02.06.2025 13:24:55] -
КонецПроцедуры   

&НаКлиенте
Процедура бит_ТоварыПроцентБракаПриИзменении(Элемент)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [02.06.2025 13:24:52] +        
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ЭтоТара = бит_ЭтоТара(ТекущиеДанные.Номенклатура);
	Если ЭтоТара Тогда
		бит_ПересчитатьКоличество(ТекущиеДанные); 
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [02.06.2025 13:24:55] -
КонецПроцедуры 

&НаКлиенте
Процедура бит_ТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [02.06.2025 13:24:52] + 
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ЭтоТара = бит_ЭтоТара(ТекущиеДанные.Номенклатура);
	Если ЭтоТара Тогда	
		бит_Пересчитатьбит_Количество(ТекущиеДанные);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [02.06.2025 13:24:55] -
КонецПроцедуры     

&НаКлиенте
Процедура бит_ПересчитатьКоличество(ТекущиеДанные)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [02.06.2025 13:24:52] + 
	ТекущиеДанные.Количество = ТекущиеДанные.бит_Количество - (ТекущиеДанные.бит_Количество * ТекущиеДанные.бит_ПроцентБрака/100);
	ТекущиеДанные.КоличествоУпаковок = ТекущиеДанные.Количество;
	// }}ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [02.06.2025 13:24:55] -
КонецПроцедуры  

&НаКлиенте
Процедура бит_Пересчитатьбит_Количество(ТекущиеДанные)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [02.06.2025 13:24:52] + 
	ТекущиеДанные.бит_Количество = ?(ТекущиеДанные.бит_ПроцентБрака = 100,ТекущиеДанные.Количество,100* ТекущиеДанные.Количество / (100 - ТекущиеДанные.бит_ПроцентБрака));	
	// }}ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [02.06.2025 13:24:55] -
КонецПроцедуры     

&НаСервереБезКонтекста
Функция бит_ЭтоТара(Номенклатура)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [02.06.2025 17:53:39] +
	ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ТипНоменклатуры");
	Возврат ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МногооборотнаяТара;
	// }}ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [02.06.2025 17:53:41] -	
КонецФункции

&НаКлиенте
&После("ТоварыНоменклатураПриИзмененииВопросПользователюЗавершение")
Процедура бит_ТоварыНоменклатураПриИзмененииВопросПользователюЗавершение(Результат, ДополнительныеПараметры)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [03.06.2025 8:42:30] +
	ТекущаяСтрока = ДополнительныеПараметры.ТекущаяСтрока;
	Если ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара") Тогда
		ТекущаяСтрока.бит_Количество = ТекущаяСтрока.Количество;
	Иначе
		ТекущаяСтрока.бит_Количество = 0;
		ТекущаяСтрока.бит_ПроцентБрака = 0;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [03.06.2025 8:42:32] -
КонецПроцедуры
